IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  INPUT-VALUE pic s9(7) comp.
01  RUNNING-TOTAL pic s9(11) comp.
01  PRINT-LINE.
    02  PRINT-MESSAGE pic x(21).
    02  PRINT-VALUE pic s9(3).
PROCEDURE DIVISION.
display "Welcome to the Advent of COBOL 2018 Edition!".
display "--------------------------------------------".
display "Source Data: https://adventofcode.com/2018/day/1/input".
display "--------------------------------------------".
display space.
GO TO 1-MAIN.
TALLY-HO-HO-HO.
    IF INPUT-VALUE IS LESS THAN ZEROS
        SUBTRACT INPUT-VALUE FROM ZEROS GIVING PRINT-VALUE
      ELSE
        MOVE INPUT-VALUE TO PRINT-VALUE
    END-IF.
    IF INPUT-VALUE IS GREATER THAN ZEROS
        MOVE "Good Number!" TO PRINT-MESSAGE
      ELSE
        MOVE "Naughty Number!" TO PRINT-MESSAGE
    END-IF.
    ADD INPUT-VALUE TO RUNNING-TOTAL.
    DISPLAY PRINT-LINE.
TALLY-EXIT.
    EXIT.
1-MAIN.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 30 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -23 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -22 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 21 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 22 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 21 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 30 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 38 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -21 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 21 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -28 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 69 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 27 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 42 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 32 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -22 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 23 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 22 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 26 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -40 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 50 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 25 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 47 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 47 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 25 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 41 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -128 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -60 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -94 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -37 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -23 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -37 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -25 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 61 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 115 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -73 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 57 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -65 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -143 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 976 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 82255 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 22 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -21 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 21 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -24 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -28 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -23 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 22 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -21 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -22 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 27 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 22 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 1 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 9 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 26 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 36 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 15 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -22 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 2 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 20 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 4 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -6 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 19 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 23 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -8 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 22 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 5 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -11 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 3 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 45 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -7 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 31 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -17 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 26 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 14 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -10 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 12 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 13 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -18 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 16 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE 27 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE -83879 TO INPUT-VALUE.
PERFORM TALLY-HO-HO-HO THRU TALLY-EXIT.
MOVE RUNNING-TOTAL TO PRINT-VALUE.
MOVE "Resulting Frequency:" TO PRINT-MESSAGE.
DISPLAY PRINT-LINE.
STOP RUN.
